[
    {
      "name": "Niki",
      "review": "Brought my phone in to get fixed and after a week I was still having a bit of an issue and took it back. Without hesitation they fixed my problem the same day. Great customer service, reasonably priced, and quick turnaround. Did research at other local repair shops in town and this was the best one.",
      "datePosted": "a year ago",
      "likes": 1
    },
    {
      "name": "Sergey Zhukov",
      "review": "Amazing place, very professional service. My Wacom tablet USB port was broken and the board was shorting, they did a free investigation and price estimate and fixed it in 2 days for a very reasonable fee. Thanks guys, highly recommend!",
      "datePosted": "7 months ago",
      "likes": 2
    },
    {
      "name": "Mark Wigglesworth",
      "review": "I highly recommend this place. Excellent customer service. My laptop crashed Sunday morning. Unfortunately I do not have a backup of my documents. I took my laptop to Tech Care Gadgets. He said it might not be possible to repair.",
      "datePosted": "a week ago",
      "likes": 1
    },
    {
      "name": "Vincent LE QUERE",
      "review": "Very professional service. I brought my laptop in to repair the hinge on my screen and the service was impeccable and the price very fair. What's more, they were completely honest. Would recommend.",
      "datePosted": "a week ago",
      "likes": 0
    },
    {
      "name": "chantal World",
      "review": "I went there to fix my mobile screen. The guy was there accommodating and fixed my phone same day. And he gave me a good deal. I definitely recommend this place for your tech repair.",
      "datePosted": "a month ago",
      "likes": 0
    },
    {
      "name": "DARRYL VINCENT",
      "review": "Wow! I just saved at least $200.00. I thought my screen was broken so I googled repairs in Newmarket and 4 places popped up. Tech Care was the first to respond with a price that I thought was high.",
      "datePosted": "3 weeks ago",
      "likes": 0
    },
    {
      "name": "Ramon Mossop",
      "review": "Just replaced my phone screen. Was very professional and did an excellent job.",
      "datePosted": "a month ago",
      "likes": 0
    },
    {
      "name": "Hashem Alsharafi",
      "review": "Not only professional, but amazing service. I read through the reviews, and as they say, actions speak louder than words, his service spoke for itself. Brought my phone in; came out as if it were brand new.",
      "datePosted": "6 months ago",
      "likes": 0
    },
    {
      "name": "Jonathan Woodley",
      "review": "Went in because my phone was not charging. The guy went straight to cleaning the port, he cleaned it all out and it had probably some concrete mix in there. The phone was now charging so I asked him how much I owed him and he said nothing.",
      "datePosted": "8 months ago",
      "likes": 1
    },
    {
      "name": "Daniel Millar",
      "review": "Came here two weeks ago to drop off a laptop. Moe was very friendly and very helpful. He guided me and explained in great detail what he believed was wrong and gave me multiple scenarios on how this could be fixed.",
      "datePosted": "a year ago",
      "likes": 0
    },
    {
      "name": "Antonio Kim",
      "review": "I repaired my desktop with this store and the service they provided was above and beyond! The owner hooked up my computer to his monitor/TV to ensure my computer was working when I went to pick it up and he explained few other tips.",
      "datePosted": "a year ago",
      "likes": 1
    },
    {
      "name": "kamran don",
      "review": "Superb customer service. Had my PS4 and Laptop repaired here for a really good price and the best quality. They had the repairs done and made my laptop faster than before. They also were able to save a backup of my data. Thank You Tech Care, I highly recommend them.",
      "datePosted": "a year ago",
      "likes": 2
    },
    {
      "name": "Shirin Khayambashi",
      "review": "This place is the best! I genuinely was so happy with their service. I broke my phone's screen and they fixed it for me the same day and their prices were so fair! Honestly, I couldn't be happier and I definitely recommend them.",
      "datePosted": "a year ago",
      "likes": 2
    },
    {
      "name": "Ken Hill",
      "review": "They replaced the damaged back of my phone and the service was excellent and the price was reasonable. I will definitely be back if I have any other such needs.",
      "datePosted": "8 months ago",
      "likes": 1
    },
    {
      "name": "T T",
      "review": "I repaired my MacBook Pro at Techcare Gadget. It works great now. Really very quick and excellent service. Very reasonably priced. Great friendly communication. Extremely happy with the service. Highly recommend for everyone.",
      "datePosted": "a year ago",
      "likes": 0
    },
    {
      "name": "Rudolf Henri Marcelo",
      "review": "I went here to have an old iPhone 6s' screen and battery replaced, and they did it in two days! The finished product was well done and of good quality. Khalil helped me out and gave me useful tech advice concerning security and device performance. I recommend this place if you need any help with electronics.",
      "datePosted": "a year ago",
      "likes": 1
    },
    {
      "name": "laura Dd",
      "review": "My daughter damaged her MacBook and I let this place fix it. They did a very nice job for a very good price. I am very happy with their services!",
      "datePosted": "a year ago",
      "likes": 0
    },
    {
      "name": "Noor Mounir",
      "review": "Mashallah! Great customer service. Mohammed was very helpful and provided me with excellent service and care! Much recommended. They have good quality and they respect their customer! Way to go Tech Care Gadgets!",
      "datePosted": "9 months ago",
      "likes": 3
    },
    {
      "name": "Dmitry Toropov",
      "review": "Replaced cracked back glass of my phone within 20 minutes.",
      "datePosted": "a month ago",
      "likes": 0
    },
    {
      "name": "Alexander Yoffe",
      "review": "Excellent service, fixed my email issue and mobile phone, and they stayed after hours for me. Highly recommend these guys for everyone around!",
      "datePosted": "10 months ago",
      "likes": 0
    },
    {
      "name": "Wayne S.",
      "review": "Fast and friendly service and a convenient location. Moe replaced my cracked iPhone screen in less than an hour. I would definitely recommend this company.",
      "datePosted": "a year ago",
      "likes": 1
    },
    {
      "name": "Sonya Shikhman",
      "review": "Great customer service and very knowledgeable staff. I needed to make sure that when I left the store my phone was fully set up. The sales associate took the time to help me with transferring all my info and all my apps and programs.",
      "datePosted": "2 years ago",
      "likes": 3
    },
    {
      "name": "Micheal Esposito",
      "review": "The owner tells me $150 to fix my screen on my cell. I get back from vacation, I call to get fixed, and buddy's partner now wants me to pay him $200 lol. You can't find any trustworthy people anymore.",
      "datePosted": "11 months ago",
      "likes": 1
    },
    {
      "name": "Kevin Earle",
      "review": "This is a pickup location for Chinese items from WISH. In February 2023, the delivery from Wish wasn't there as notified. Waste of my time.",
      "datePosted": "4 months ago",
      "likes": 0
    },
    {
      "name": "Brian McAteer",
      "review": "Excellent service, from walk-in to. The cell phone was fixed in one day. Informed me and got my OK before completing the fix.",
      "datePosted": "10 months ago",
      "likes": 0
    },
    {
      "name": "Sakina Hussain",
      "review": "Best service ever!! I recommend Jay at Tech Care Gadgets to everyone.",
      "datePosted": "6 months ago",
      "likes": 0
    }
  ]
  